# LandingNotEnoughBoundaryCurves Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..LandingNotEnoughBoundaryCurves Property
BuiltInFailures..::..SketchFailures Class See Also
---
Sketch landing require boundaries
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId LandingNotEnoughBoundaryCurves { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LandingNotEnoughBoundaryCurves As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ LandingNotEnoughBoundaryCurves {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace